// Напишите программу, которая 
// 1. на вход принимает число 
// 2. и выдаёт его квадрат (число
// умноженное на само себя).
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

Console.Write("Введите целое число: ");
int num = Convert.ToInt32(Console.ReadLine());  // int: - от - 2 147 483 648 до 2 147 483 647
int square = num * num;
Console.Write($"Квадрат числа {num} = {square}");


if (num == 5 && num == 7)
{

}
else if (num == 6 || num != 3)
{

}
else
{

}